# GetFluidType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FluidType..::..GetFluidType Method
FluidType Class See Also
---
Gets a fluid type by name.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static FluidType GetFluidType(
	Document document,
	string fluidTypeName
)
```

Visual Basic
---
```text
Public Shared Function GetFluidType ( _
	document As Document, _
	fluidTypeName As String _
) As FluidType
```

Visual C++
---
```text
public:
static FluidType^ GetFluidType(
	Document^ document,
	String^ fluidTypeName
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
fluidTypeName
    Type: System..::..String The name of fluid type.
# ### Return Value
The fluid type. nullNothingnullptra null reference (Nothing in Visual Basic) if the fluid type was not found.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace